Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.destructiveWrites.help
source: Allow replace/delete-style local writes such as replacing all tags on a repository. Keep this off unless the connected agent is trusted.
ar: السماح بعمليات الكتابة المحلية من نوع الاستبدال/الحذف مثل استبدال جميع العلامات على مستودع. أبقِ هذا معطلاً ما لم يكن الوكيل المتصل موثوقًا.
de: Erlauben Sie lokale Schreibvorgänge vom Typ Ersetzen/Löschen, z. B. das Ersetzen aller Tags eines Repositorys. Lassen Sie dies deaktiviert, es sei denn, der verbundene Agent ist vertrauenswürdig.
es: Permite escrituras locales de tipo reemplazar/eliminar, como reemplazar todas las etiquetas de un repositorio. Mantén esto desactivado a menos que el agente conectado sea de confianza.
fr: Autoriser les écritures locales de type remplacement/suppression, comme le remplacement de tous les tags d'un dépôt. Désactivez cette option sauf si l'agent connecté est de confiance.
id: Izinkan tulis lokal gaya ganti/hapus seperti mengganti semua tag pada repositori. Matikan ini kecuali agen yang terhubung tepercaya.
it: Consenti scritture locali di tipo sostituzione/cancellazione, come la sostituzione di tutti i tag su un repository. Tienilo disattivato a meno che l'agente connesso non sia fidato.
ja: リポジトリのすべてのタグを置き換えるなど、置換/削除スタイルのローカル書き込みを許可します。接続されたエージェントが信頼されていない限り、オフのままにしてください。
ko: 저장소의 모든 태그를 바꾸는 등 로컬 쓰기에서 바꾸기/삭제 스타일을 허용합니다. 연결된 에이전트를 신뢰할 수 없는 경우 이 기능을 끄십시오.
nl: Lokale schrijfbewerkingen van het type vervangen/verwijderen toestaan, zoals het vervangen van alle tags in een repository. Houd dit uitgeschakeld tenzij de verbonden agent wordt vertrouwd.
pl: Zezwól na lokalne zapisy typu zamień/usuń, takie jak zastąpienie wszystkich tagów w repozytorium. Wyłącz tę opcję, chyba że podłączony agent jest zaufany.
pt_br: Permitir gravações locais do tipo substituir/excluir, como substituir todas as etiquetas em um repositório. Mantenha isso desativado, a menos que o agente conectado seja confiável.
ru: Разрешить локальные записи типа замены/удаления, например, замену всех тегов в репозитории. Отключайте, если подключённый агент не является доверенным.
tr: Bir depodaki tüm etiketleri değiştirme gibi değiştirme/silme türü yerel yazmalara izin ver. Bağlı aracı güvenilir değilse bunu kapalı tutun.
uk: Дозволити локальні записи типу заміни/видалення, наприклад заміну всіх тегів у репозиторії. Вимикайте, якщо підключений агент не є довіреним.
vi: Cho phép ghi cục bộ kiểu thay thế/xóa như thay thế tất cả thẻ trên một kho lưu trữ. Tắt tính năng này trừ khi tác nhân được kết nối là đáng tin cậy.
zh_hans: 允许替换/删除式本地写入，例如替换某个仓库的全部标签。只有信任连接的 Agent 时才开启。
zh_hant: 允許取代/刪除式本地寫入，例如取代儲存庫的所有標籤。除非信任已連接的 Agent，否則請保持關閉。

# settings.mcp.destructiveWrites.title
source: Allow replace/delete writes
ar: السماح بعمليات الكتابة بالاستبدال/الحذف
de: Ersetzen/Löschen-Schreibvorgänge erlauben
es: Permitir escrituras de reemplazo/eliminación
fr: Autoriser les écritures de remplacement/suppression
id: Izinkan tulis ganti/hapus
it: Consenti scritture di sostituzione/cancellazione
ja: 置換/削除書き込みを許可
ko: 바꾸기/삭제 쓰기 허용
nl: Vervang-/verwijderschrijfbewerkingen toestaan
pl: Zezwól na zapisy zamiany/usuwania
pt_br: Permitir gravações de substituição/exclusão
ru: Разрешить замену/удаление
tr: Değiştirme/silme yazmalarına izin ver
uk: Дозволити записи заміни/видалення
vi: Cho phép ghi thay thế/xóa
zh_hans: 允许替换/删除式写入
zh_hant: 允許取代/刪除式寫入

# settings.mcp.devices.revoke
source: Revoke
ar: إبطال
de: Widerrufen
es: Revocar
fr: Révoquer
id: Cabut
it: Revoca
ja: 取り消し
ko: 해지
nl: Intrekken
pl: Odwołaj
pt_br: Revogar
ru: Отозвать
tr: İptal Et
uk: Відкликати
vi: Thu hồi
zh_hans: 撤销
zh_hant: 撤銷

# settings.mcp.enabled.help
source: Expose Starcat capabilities to local agents through a Pro-only localhost MCP endpoint.
ar: عرض إمكانيات Starcat للوكلاء المحليين من خلال نقطة نهاية MCP على localhost حصرية لـ Pro.
de: Starcat-Fähigkeiten für lokale Agenten über einen Pro-exklusiven localhost MCP-Endpunkt bereitstellen.
es: Expone las capacidades de Starcat a agentes locales a través de un endpoint MCP localhost solo para Pro.
fr: Exposer les capacités de Starcat aux agents locaux via un point de terminaison MCP localhost réservé aux abonnés Pro.
id: Ekspos kemampuan Starcat ke agen lokal melalui endpoint MCP localhost khusus Pro.
it: Esponi le capacità di Starcat agli agenti locali tramite un endpoint MCP localhost solo per Pro.
ja: Pro専用のlocalhost MCPエンドポイントを通じて、Starcatの機能をローカルエージェントに公開します。
ko: Pro 전용 로컬호스트 MCP 엔드포인트를 통해 로컬 에이전트에 Starcat 기능을 노출합니다.
nl: Stel Starcat-mogelijkheden beschikbaar voor lokale agents via een alleen-Pro localhost MCP-eindpunt.
pl: Udostępnij możliwości Starcat lokalnym agentom przez punkt końcowy MCP localhost dostępny tylko w wersji Pro.
pt_br: Expor as capacidades do Starcat a agentes locais por meio de um endpoint MCP localhost exclusivo para Pro.
ru: Предоставить возможности Starcat локальным агентам через конечную точку MCP localhost, доступную только в Pro.
tr: Starcat yeteneklerini yerel aracılara yalnızca Pro'ya özel bir localhost MCP uç noktası aracılığıyla göster.
uk: Відкрити можливості Starcat для локальних агентів через кінцеву точку MCP localhost, доступну лише для Pro.
vi: Hiển thị khả năng của Starcat cho các tác nhân cục bộ thông qua điểm cuối MCP localhost chỉ dành cho Pro.
zh_hans: 通过仅限 Pro 的 localhost MCP endpoint 向本机 Agent 暴露 Starcat 能力。
zh_hant: 透過僅限 Pro 的 localhost MCP 端點向本機 Agent 公開 Starcat 功能。

# settings.mcp.enabled.title
source: Enable MCP Service
ar: تمكين خدمة MCP
de: MCP-Dienst aktivieren
es: Habilitar servicio MCP
fr: Activer le service MCP
id: Aktifkan Layanan MCP
it: Abilita servizio MCP
ja: MCPサービスを有効にする
ko: MCP 서비스 활성화
nl: MCP-service inschakelen
pl: Włącz usługę MCP
pt_br: Ativar Serviço MCP
ru: Включить MCP-сервис
tr: MCP Servisini Etkinleştir
uk: Увімкнути MCP-сервіс
vi: Bật dịch vụ MCP
zh_hans: 启用 MCP Service
zh_hant: 啟用 MCP Service

# settings.mcp.endpoint
source: Endpoint
ar: نقطة النهاية
de: Endpunkt
fr: Point de terminaison
ja: エンドポイント
ko: 엔드포인트
nl: Eindpunt
pl: Punkt końcowy
ru: Конечная точка
tr: Uç Nokta
uk: Кінцева точка
vi: Điểm cuối
zh_hant: 端點

# settings.mcp.localAPIKey.help
source: MCP uses the shared Local API Key from Settings > Integrations > Local API Key. Rotating that key invalidates existing MCP client configs.
ar: يستخدم MCP مفتاح API المحلي المشترك من الإعدادات > التكاملات > مفتاح API المحلي. يؤدي تدوير هذا المفتاح إلى إبطال تكوينات عميل MCP الحالية.
de: MCP verwendet den gemeinsamen lokalen API-Schlüssel aus Einstellungen > Integrationen > Lokaler API-Schlüssel. Das Rotieren dieses Schlüssels macht bestehende MCP-Client-Konfigurationen ungültig.
es: MCP usa la clave API local compartida de Ajustes > Integraciones > Clave API local. Rotar esa clave invalida las configuraciones existentes del cliente MCP.
fr: MCP utilise la clé API locale partagée depuis Réglages > Intégrations > Clé API locale. La rotation de cette clé invalide les configurations MCP client existantes.
id: MCP menggunakan Kunci API Lokal bersama dari Pengaturan > Integrasi > Kunci API Lokal. Memutar kunci itu membatalkan konfigurasi klien MCP yang ada.
it: MCP utilizza la chiave API locale condivisa da Impostazioni > Integrazioni > Chiave API locale. La rotazione di quella chiave invalida le configurazioni esistenti del client MCP.
ja: MCPは設定 > 統合 > ローカルAPIキーの共有ローカルAPIキーを使用します。そのキーをローテーションすると、既存のMCPクライアント設定が無効になります。
ko: MCP는 설정 > 통합 > 로컬 API 키의 공유 로컬 API 키를 사용합니다. 해당 키를 교체하면 기존 MCP 클라이언트 구성이 무효화됩니다.
nl: MCP gebruikt de gedeelde lokale API-sleutel uit Instellingen > Integraties > Lokale API-sleutel. Het roteren van die sleutel maakt bestaande MCP-clientconfiguraties ongeldig.
pl: MCP używa współdzielonego lokalnego klucza API z Ustawienia > Integracje > Lokalny klucz API. Obrót tego klucza unieważnia istniejące konfiguracje klienta MCP.
pt_br: O MCP usa a Chave de API Local compartilhada de Ajustes > Integrações > Chave de API Local. Rotacionar essa chave invalida as configurações existentes do cliente MCP.
ru: MCP использует общий локальный API-ключ из Настроек > Интеграции > Локальный API-ключ. Смена ключа делает недействительными существующие конфигурации MCP-клиентов.
tr: MCP, Ayarlar > Entegrasyonlar > Yerel API Anahtarı'ndaki paylaşılan Yerel API Anahtarını kullanır. Bu anahtarı döndürmek, mevcut MCP istemci yapılandırmalarını geçersiz kılar.
uk: MCP використовує спільний локальний API-ключ з Налаштування > Інтеграції > Локальний API-ключ. Зміна цього ключа анулює існуючі конфігурації MCP-клієнтів.
vi: MCP sử dụng Khóa API cục bộ được chia sẻ từ Cài đặt > Tích hợp > Khóa API cục bộ. Xoay khóa đó sẽ vô hiệu hóa cấu hình ứng dụng khách MCP hiện có.
zh_hans: MCP 使用「设置 → 集成 → 本地 API Key」中的共享 key。刷新该 key 后，已有 MCP 客户端配置会失效。
zh_hant: MCP 使用「設定 > 整合 > 本地 API Key」中的共用 Local API Key。輪換該金鑰會使現有 MCP 用戶端設定失效。

# settings.mcp.localAPIKey.open
source: Get API Key
ar: الحصول على مفتاح API
de: API-Schlüssel abrufen
es: Obtener clave API
fr: Obtenir la clé API
id: Dapatkan Kunci API
it: Ottieni chiave API
ja: APIキーを取得
ko: API 키 가져오기
nl: API-sleutel ophalen
pl: Pobierz klucz API
pt_br: Obter Chave de API
ru: Получить API-ключ
tr: API Anahtarı Al
uk: Отримати API-ключ
vi: Lấy khóa API
zh_hans: 获取 API Key
zh_hant: 取得 API Key

# settings.mcp.localWrites.help
source: Allow local MCP tools to write notes, statuses, and tags. This never performs GitHub remote star/unstar actions.
ar: السماح لأدوات MCP المحلية بكتابة الملاحظات والحالات والعلامات. هذا لا يقوم أبدًا بإجراءات الإضافة/الإزالة عن بعد على GitHub.
de: Erlauben Sie lokalen MCP-Tools, Notizen, Status und Tags zu schreiben. Dies führt niemals GitHub-Fernaktionen wie Star/Unstar aus.
es: Permite que las herramientas MCP locales escriban notas, estados y etiquetas. Esto nunca realiza acciones de estrella/desestrella en GitHub remoto.
fr: Autoriser les outils MCP locaux à écrire des notes, des statuts et des tags. Cela n'effectue jamais d'actions d'étoile/désétoile à distance sur GitHub.
id: Izinkan alat MCP lokal untuk menulis catatan, status, dan tag. Ini tidak pernah melakukan tindakan star/unstar jarak jauh GitHub.
it: Consenti agli strumenti MCP locali di scrivere note, stati e tag. Questo non esegue mai azioni remote di stella/non stella su GitHub.
ja: ローカルMCPツールがノート、ステータス、タグを書き込むことを許可します。これはGitHub上のスター/アンスター操作を決して実行しません。
ko: 로컬 MCP 도구가 메모, 상태 및 태그를 쓸 수 있도록 허용합니다. 이는 GitHub 원격 별표/별표 해제 작업을 수행하지 않습니다.
nl: Lokale MCP-tools toestaan om notities, statussen en tags te schrijven. Dit voert nooit GitHub-verre ster-/ontster-acties uit.
pl: Zezwól lokalnym narzędziom MCP na zapisywanie notatek, statusów i tagów. To nigdy nie wykonuje zdalnych akcji star/unstar w GitHub.
pt_br: Permitir que ferramentas MCP locais gravem notas, status e etiquetas. Isso nunca executa ações remotas de estrelar/desestrelar no GitHub.
ru: Разрешить локальным MCP-инструментам записывать заметки, статусы и теги. Это никогда не выполняет удалённые действия star/unstar на GitHub.
tr: Yerel MCP araçlarının not, durum ve etiket yazmasına izin ver. Bu asla GitHub uzak yıldız/yıldız kaldırma işlemleri gerçekleştirmez.
uk: Дозволити локальним MCP-інструментам записувати нотатки, статуси та теги. Це ніколи не виконує дії зірок/анзірк GitHub віддалено.
vi: Cho phép các công cụ MCP cục bộ ghi ghi chú, trạng thái và thẻ. Thao tác này không bao giờ thực hiện hành động star/unstar từ xa trên GitHub.
zh_hans: 允许本地 MCP 工具写入笔记、状态和标签。此开关不会执行 GitHub 远端 star/unstar 操作。
zh_hant: 允許本地 MCP 工具寫入筆記、狀態和標籤。此操作絕不會執行 GitHub 遠端 star/unstar 動作。

# settings.mcp.localWrites.title
source: Allow local writes
ar: السماح بالكتابة المحلية
de: Lokale Schreibvorgänge erlauben
es: Permitir escrituras locales
fr: Autoriser les écritures locales
id: Izinkan tulis lokal
it: Consenti scritture locali
ja: ローカル書き込みを許可
ko: 로컬 쓰기 허용
nl: Lokale schrijfbewerkingen toestaan
pl: Zezwól na zapisy lokalne
pt_br: Permitir gravações locais
ru: Разрешить локальную запись
tr: Yerel yazmalara izin ver
uk: Дозволити локальний запис
vi: Cho phép ghi cục bộ
zh_hans: 允许本地写入
zh_hant: 允許本地寫入

# settings.mcp.pairing.error.expired
source: The pairing invitation has expired. Generate a new one in Starcat.
ar: انتهت صلاحية دعوة الاقتران. قم بإنشاء واحدة جديدة في Starcat.
de: Die Pairing-Einladung ist abgelaufen. Generieren Sie eine neue in Starcat.
es: La invitación de emparejamiento ha caducado. Genera una nueva en Starcat.
fr: L'invitation d'appairage a expiré. Générez-en une nouvelle dans Starcat.
id: Undangan pemasangan telah kedaluwarsa. Buat yang baru di Starcat.
it: L'invito di abbinamento è scaduto. Generane uno nuovo in Starcat.
ja: ペアリング招待の有効期限が切れました。Starcatで新しいものを生成してください。
ko: 페어링 초대가 만료되었습니다. Starcat에서 새 초대를 생성하세요.
nl: De koppelingsuitnodiging is verlopen. Genereer een nieuwe in Starcat.
pl: Zaproszenie do parowania wygasło. Wygeneruj nowe w Starcat.
pt_br: O convite de emparelhamento expirou. Gere um novo no Starcat.
ru: Срок действия приглашения на сопряжение истёк. Создайте новое в Starcat.
tr: Eşleme davetiyesinin süresi doldu. Starcat'ta yeni bir tane oluşturun.
uk: Термін дії запрошення на сполучення минув. Створіть нове в Starcat.
vi: Lời mời ghép nối đã hết hạn. Hãy tạo lời mời mới trong Starcat.
zh_hans: 配对邀请已过期，请在 Starcat 中重新生成。
zh_hant: 配對邀請已過期。請在 Starcat 中產生新的邀請。

# settings.mcp.pairing.error.invalidInvitation
source: The pairing invitation is invalid or has already been used.
ar: دعوة الاقتران غير صالحة أو تم استخدامها بالفعل.
de: Die Pairing-Einladung ist ungültig oder wurde bereits verwendet.
es: La invitación de emparejamiento no es válida o ya ha sido utilizada.
fr: L'invitation d'appairage est invalide ou a déjà été utilisée.
id: Undangan pemasangan tidak valid atau sudah digunakan.
it: L'invito di abbinamento non è valido o è già stato utilizzato.
ja: ペアリング招待が無効か、既に使用されています。
ko: 페어링 초대가 유효하지 않거나 이미 사용되었습니다.
nl: De koppelingsuitnodiging is ongeldig of is al gebruikt.
pl: Zaproszenie do parowania jest nieprawidłowe lub zostało już użyte.
pt_br: O convite de emparelhamento é inválido ou já foi usado.
ru: Приглашение на сопряжение недействительно или уже было использовано.
tr: Eşleme davetiyesi geçersiz veya zaten kullanılmış.
uk: Запрошення на сполучення недійсне або вже використане.
vi: Lời mời ghép nối không hợp lệ hoặc đã được sử dụng.
zh_hans: 配对邀请无效或已经使用。
zh_hant: 配對邀請無效或已被使用。

# settings.mcp.pairing.error.pending
source: Another device is already waiting for pairing approval.
ar: جهاز آخر ينتظر بالفعل موافقة الاقتران.
de: Ein anderes Gerät wartet bereits auf Pairing-Genehmigung.
es: Otro dispositivo ya está esperando la aprobación de emparejamiento.
fr: Un autre appareil attend déjà l'approbation d'appairage.
id: Perangkat lain sudah menunggu persetujuan pemasangan.
it: Un altro dispositivo è già in attesa di approvazione dell'abbinamento.
ja: 別のデバイスが既にペアリング承認を待っています。
ko: 다른 장치가 이미 페어링 승인을 기다리고 있습니다.
nl: Er wacht al een ander apparaat op goedkeuring van de koppeling.
pl: Inne urządzenie już czeka na zatwierdzenie parowania.
pt_br: Outro dispositivo já está aguardando aprovação de emparelhamento.
ru: Другое устройство уже ожидает подтверждения сопряжения.
tr: Başka bir cihaz zaten eşleme onayı bekliyor.
uk: Інший пристрій уже очікує на підтвердження сполучення.
vi: Một thiết bị khác đang chờ phê duyệt ghép nối.
zh_hans: 已有另一台设备正在等待配对确认。
zh_hant: 另一台裝置已在等待配對核准。

# settings.mcp.pairing.error.rejected
source: The pairing request was rejected or timed out.
ar: تم رفض طلب الاقتران أو انتهت مهلة الانتظار.
de: Die Pairing-Anfrage wurde abgelehnt oder ist abgelaufen.
es: La solicitud de emparejamiento fue rechazada o caducó.
fr: La demande d'appairage a été rejetée ou a expiré.
id: Permintaan pemasangan ditolak atau waktu habis.
it: La richiesta di abbinamento è stata rifiutata o è scaduta.
ja: ペアリングリクエストが拒否されたか、タイムアウトしました。
ko: 페어링 요청이 거부되었거나 시간이 초과되었습니다.
nl: Het koppelingsverzoek is geweigerd of de tijd is verstreken.
pl: Żądanie parowania zostało odrzucone lub upłynął jego limit czasu.
pt_br: A solicitação de emparelhamento foi rejeitada ou expirou.
ru: Запрос на сопряжение был отклонён или истёк по времени.
tr: Eşleme isteği reddedildi veya zaman aşımına uğradı.
uk: Запит на сполучення відхилено або час очікування минув.
vi: Yêu cầu ghép nối đã bị từ chối hoặc hết thời gian chờ.
zh_hans: 配对请求已拒绝或等待超时。
zh_hant: 配對請求已拒絕或逾時。

# settings.mcp.pairing.sheet.approve
source: Approve device
ar: الموافقة على الجهاز
de: Gerät genehmigen
es: Aprobar dispositivo
fr: Approuver l'appareil
id: Setujui perangkat
it: Approva dispositivo
ja: デバイスを承認
ko: 장치 승인
nl: Apparaat goedkeuren
pl: Zatwierdź urządzenie
pt_br: Aprovar dispositivo
ru: Подтвердить устройство
tr: Cihazı onayla
uk: Підтвердити пристрій
vi: Phê duyệt thiết bị
zh_hans: 允许此设备
zh_hant: 核准裝置

# settings.mcp.pairing.sheet.cliVersion
source: CLI version
ar: إصدار CLI
es: Versión de la CLI
fr: Version de la CLI
id: Versi CLI
it: Versione CLI
ja: CLIバージョン
ko: CLI 버전
nl: CLI-versie
pl: Wersja CLI
pt_br: Versão da CLI
ru: Версия CLI
tr: CLI sürümü
uk: Версія CLI
vi: Phiên bản CLI
zh_hans: CLI 版本
zh_hant: CLI 版本

# settings.mcp.pairing.sheet.device
source: Device
ar: الجهاز
de: Gerät
es: Dispositivo
fr: Appareil
id: Perangkat
it: Dispositivo
ja: デバイス
ko: 장치
nl: Apparaat
pl: Urządzenie
pt_br: Dispositivo
ru: Устройство
tr: Cihaz
uk: Пристрій
vi: Thiết bị
zh_hans: 设备
zh_hant: 裝置

# settings.mcp.pairing.sheet.help
source: This device is requesting access to the Starcat MCP Service.
ar: يطلب هذا الجهاز الوصول إلى خدمة Starcat MCP.
de: Dieses Gerät fordert Zugriff auf den Starcat MCP-Dienst an.
es: Este dispositivo está solicitando acceso al servicio MCP de Starcat.
fr: Cet appareil demande l'accès au service MCP Starcat.
id: Perangkat ini meminta akses ke Layanan MCP Starcat.
it: Questo dispositivo richiede l'accesso al servizio MCP di Starcat.
ja: このデバイスがStarcat MCPサービスへのアクセスを要求しています。
ko: 이 장치가 Starcat MCP 서비스에 대한 액세스를 요청하고 있습니다.
nl: Dit apparaat vraagt toegang tot de Starcat MCP-service.
pl: To urządzenie żąda dostępu do usługi MCP Starcat.
pt_br: Este dispositivo está solicitando acesso ao Serviço MCP do Starcat.
ru: Это устройство запрашивает доступ к MCP-сервису Starcat.
tr: Bu cihaz Starcat MCP Servisi'ne erişim talep ediyor.
uk: Цей пристрій запитує доступ до MCP-сервісу Starcat.
vi: Thiết bị này đang yêu cầu quyền truy cập vào Dịch vụ MCP của Starcat.
zh_hans: 这台设备正在请求访问 Starcat MCP Service。
zh_hant: 此裝置正在要求存取 Starcat MCP Service。

# settings.mcp.pairing.sheet.platform
source: Platform
ar: المنصة
de: Plattform
es: Plataforma
fr: Plateforme
it: Piattaforma
ja: プラットフォーム
ko: 플랫폼
pl: Platforma
pt_br: Plataforma
ru: Платформа
uk: Платформа
vi: Nền tảng
zh_hans: 平台
zh_hant: 平台

# settings.mcp.pairing.sheet.security
source: Approve only if you initiated pairing. The device receives an independent credential that can be revoked later.
ar: وافق فقط إذا كنت قد بدأت الاقتران. يتلقى الجهاز اعتمادًا مستقلاً يمكن إبطاله لاحقًا.
de: Genehmigen Sie nur, wenn Sie das Pairing initiiert haben. Das Gerät erhält eine unabhängige Berechtigung, die später widerrufen werden kann.
es: Aprueba solo si iniciaste el emparejamiento. El dispositivo recibe una credencial independiente que puede revocarse más tarde.
fr: Approuvez uniquement si vous avez initié l'appairage. L'appareil reçoit une information d'identification indépendante qui peut être révoquée ultérieurement.
id: Setujui hanya jika Anda memulai pemasangan. Perangkat menerima kredensial independen yang dapat dicabut nanti.
it: Approva solo se hai avviato tu l'abbinamento. Il dispositivo riceve una credenziale indipendente che può essere revocata in seguito.
ja: 自分がペアリングを開始した場合のみ承認してください。デバイスは後で取り消し可能な独立した資格情報を受け取ります。
ko: 직접 페어링을 시작한 경우에만 승인하세요. 장치는 나중에 해지할 수 있는 독립적인 자격 증명을 받습니다.
nl: Keur alleen goed als je de koppeling hebt gestart. Het apparaat ontvangt een onafhankelijke referentie die later kan worden ingetrokken.
pl: Zatwierdź tylko wtedy, gdy sam zainicjowałeś parowanie. Urządzenie otrzymuje niezależne poświadczenie, które można później odwołać.
pt_br: Aprove apenas se você iniciou o emparelhamento. O dispositivo recebe uma credencial independente que pode ser revogada posteriormente.
ru: Подтверждайте, только если вы инициировали сопряжение. Устройство получает независимые учётные данные, которые можно отозвать позже.
tr: Yalnızca eşlemeyi siz başlattıysanız onaylayın. Cihaz, daha sonra iptal edilebilecek bağımsız bir kimlik bilgisi alır.
uk: Підтверджуйте, лише якщо ви ініціювали сполучення. Пристрій отримує незалежні облікові дані, які можна відкликати пізніше.
vi: Chỉ phê duyệt nếu bạn đã khởi tạo ghép nối. Thiết bị nhận được thông tin xác thực độc lập có thể bị thu hồi sau đó.
zh_hans: 仅在你主动发起配对时允许。该设备将获得可单独撤销的独立凭据。
zh_hant: 僅在你主動發起配對時核准。該裝置將獲得可稍後撤銷的獨立憑證。

# settings.mcp.pairing.sheet.title
source: Pair Starcat CLI
ar: اقتران Starcat CLI
de: Starcat CLI paaren
es: Emparejar CLI de Starcat
fr: Appairer la CLI Starcat
id: Pasangkan Starcat CLI
it: Abbina CLI Starcat
ja: Starcat CLIをペアリング
ko: Starcat CLI 페어링
nl: Starcat CLI koppelen
pl: Sparuj Starcat CLI
pt_br: Emparelhar CLI do Starcat
ru: Сопряжение Starcat CLI
tr: Starcat CLI'yı Eşle
uk: Сполучити Starcat CLI
vi: Ghép nối Starcat CLI
zh_hans: 配对 Starcat CLI
zh_hant: 配對 Starcat CLI

# settings.mcp.port
source: Port (1024–65535)
ar: المنفذ (1024–65535)
es: Puerto (1024–65535)
it: Porta (1024–65535)
ja: ポート（1024～65535）
ko: 포트 (1024–65535)
nl: Poort (1024–65535)
pt_br: Porta (1024–65535)
ru: Порт (1024–65535)
uk: Порт (1024–65535)
vi: Cổng (1024–65535)
zh_hans: 端口(1024-65535)
zh_hant: 連接埠 (1024–65535)

# settings.mcp.port.error.checkFailed
source: Could not verify this port. Try another port or restart Starcat.
ar: تعذّر التحقق من هذا المنفذ. جرّب منفذًا آخر أو أعد تشغيل Starcat.
de: Dieser Port konnte nicht überprüft werden. Versuchen Sie einen anderen Port oder starten Sie Starcat neu.
es: No se pudo verificar este puerto. Prueba con otro puerto o reinicia Starcat.
fr: Impossible de vérifier ce port. Essayez un autre port ou redémarrez Starcat.
id: Tidak dapat memverifikasi port ini. Coba port lain atau mulai ulang Starcat.
it: Impossibile verificare questa porta. Prova un'altra porta o riavvia Starcat.
ja: このポートを確認できませんでした。別のポートを試すか、Starcatを再起動してください。
ko: 이 포트를 확인할 수 없습니다. 다른 포트를 사용하거나 Starcat을 다시 시작하세요.
nl: Kan deze poort niet verifiëren. Probeer een andere poort of herstart Starcat.
pl: Nie można zweryfikować tego portu. Spróbuj innego portu lub uruchom ponownie Starcat.
pt_br: Não foi possível verificar esta porta. Tente outra porta ou reinicie o Starcat.
ru: Не удалось проверить этот порт. Попробуйте другой порт или перезапустите Starcat.
tr: Bu port doğrulanamadı. Başka bir port deneyin veya Starcat'i yeniden başlatın.
uk: Не вдалося перевірити цей порт. Спробуйте інший порт або перезапустіть Starcat.
vi: Không thể xác minh cổng này. Hãy thử cổng khác hoặc khởi động lại Starcat.
zh_hans: 无法确认这个端口是否可用，请换一个端口或重启 Starcat 后再试。
zh_hant: 無法確認此連接埠。請嘗試其他連接埠或重新啟動 Starcat。

# settings.mcp.port.error.digitsOnly
source: Port must contain digits only.
ar: يجب أن يحتوي المنفذ على أرقام فقط.
de: Der Port darf nur Ziffern enthalten.
es: El puerto solo debe contener dígitos.
fr: Le port ne doit contenir que des chiffres.
id: Port hanya boleh berisi angka.
it: La porta deve contenere solo cifre.
ja: ポートは数字のみで構成されている必要があります。
ko: 포트는 숫자만 포함해야 합니다.
nl: Poort mag alleen cijfers bevatten.
pl: Port może zawierać tylko cyfry.
pt_br: A porta deve conter apenas dígitos.
ru: Порт должен содержать только цифры.
tr: Port yalnızca rakamlardan oluşmalıdır.
uk: Порт має містити лише цифри.
vi: Cổng chỉ được chứa chữ số.
zh_hans: 端口只能包含数字。
zh_hant: 連接埠只能包含數字。
